package com.hezekiah.count;

import javax.swing.*;

public class VariableData extends JFrame {
    public static double 期望伤害, 暴击伤害, 不暴击伤害, 增幅反应伤害, 激化反应伤害, 聚变反应伤害, 攻击区, 倍率区, 增伤区, 反应区, 暴伤区, 暴击区, 防御区, 抗性区;
    public static double[] basicattr = {0, 0, 0, 0};
    public static double[] advattr = {0, 0};
    public static double[] addattr = {1, 100, 0, 0};
    public static double[] enattr = {1, 0, 0, 0};
    //                            火蒸，水蒸，冰融，火融
    public static double[] 增幅反应系数 = {1.5, 2.0, 1.5, 2.0};
    //                                    扩散，燃烧，碎冰，超载，超导，感电，绽放，烈绽放，超绽放
    public static double[] 聚变反应系数 = {0.6, 0.25, 3.0, 2.75, 1.5, 2.0, 2.0, 3.0, 3.0};
    //                            超激，蔓激
    public static double[] 激化反应系数 = {1.15, 1.25};
    public static double[] AmplifyingDamage = new double[增幅反应系数.length];
    public static double[] CatalyzeDamage = new double[激化反应系数.length];
    public static double[] TransformativeDamage = new double[聚变反应系数.length];
    public static double[] 等级基础系数 = {
            17.165605, 18.535048, 19.904854, 21.274903, 22.6454, 24.649613, 26.640643, 28.868587, 31.367679, 34.143343,
            37.201, 40.66, 44.446668, 48.563519, 53.74848, 59.081897, 64.420047, 69.724455, 75.123137, 80.584775,
            86.112028, 91.703742, 97.244628, 102.812644, 108.409563, 113.201694, 118.102906, 122.979318, 129.72733, 136.29291,
            142.67085, 149.029029, 155.416987, 161.825495, 169.106313, 176.518077, 184.072741, 191.709518, 199.556908, 207.382042,
            215.3989, 224.165667, 233.50216, 243.350573, 256.063067, 268.543493, 281.526075, 295.013648, 309.067188, 323.601597, 336.757542,
            350.530312, 364.482705, 378.619181, 398.600417, 416.398254, 434.386996, 452.951051, 472.606217, 492.88489,
            513.568543, 539.103198, 565.510563, 592.538753, 624.443427, 651.470148, 679.49683, 707.79406, 736.671422, 765.640231,
            794.773403, 824.677397, 851.157781, 877.74209, 914.229123, 946.746752, 979.411386, 1011.223022, 1044.791746, 1077.443668,
            1109.99754, 1142.976615, 1176.369483, 1210.184393, 1253.835659, 1288.952801, 1325.484092, 1363.456928, 1405.097377, 1446.853458,
            1488.215547, 1528.444567, 1580.367911, 1630.847528, 1711.197785, 1780.453941, 1847.322809, 1911.474309, 1972.864342, 2030.071808};
    public JPanel[] jPanels = new JPanel[2];
    public JButton jButtons = new JButton();
    //    String[] MulZone = {"攻击区", "倍率区","增伤区","反应区","暴伤区","暴击区","防御区","抗性区"};
    public String[] MulZone0 = {"基础属性", "进阶属性", "加成类", "怪物面板", "伤害乘区", "基本伤害", "增幅伤害", "激化伤害", "聚变伤害"};
    public String[] MulZone1 = {"生命", "攻击", "防御", "元素精通"};
    public String[] MulZone2 = {"暴击率", "暴击伤害"};
    public String[] MulZone3 = {"等级", "技能倍率", "伤害加成", "反应系数加成"};
    public String[] MulZone4 = {"等级", "抗性", "减防", "无视防御"};
    public String[] MulZone5 = {"攻击区", "倍率区", "增伤区", "反应区", "暴伤区", "暴击区", "防御区", "抗性区"};
    public String[] MulZone6 = {"不暴击伤害", "暴击伤害", "期望伤害"};
    public String[] MulZone7 = {"蒸发（火，水）", "融化（冰，火）"};
    public String[] MulZone8 = {"超激化", "蔓激化"};
    public String[] MulZone9 = {"扩散", "燃烧", "碎冰", "超载", "超导", "感电", "绽放", "烈绽放", "超绽放"};
    public JTextField[] jTextFields_1, jTextFields_2, jTextFields_3, jTextFields_4, jTextFields_5, jTextFields_6, jTextFields_7, jTextFields_8, jTextFields_9;
    ;

}
