package com.hezekiah.count;

public class CountData {
    //伤害乘区
    float 最大伤害=0,期望伤害=0,攻击区=1, 倍率区=1,增伤区=1,反应区=1,暴伤区=1,暴击区=1,防御区=1,抗性区=1;
    //攻击乘区
    float 基础攻击=0,额外攻击=0,百分比攻击=0,角色基础攻击=0,武器基础攻击=0,武器百分比攻击=0,圣遗物百分比攻击=0,其他百分比攻击=0,圣遗物数值攻击=0,其他攻击=0;
    //倍率乘区
    float 技能倍率=1;
    //增伤乘区
    float 增伤=1;
    //反应乘区

    //暴伤乘区

    //暴击乘区

    //防御乘区

    //抗性乘区




    public void set最大伤害(float 最大伤害) {
        this.最大伤害 = 攻击区 * 倍率区 * 增伤区 * 反应区 * 暴伤区 * 防御区 * 抗性区;
    }

    public void set期望伤害(float 期望伤害) {
        this.期望伤害 = 攻击区 * 倍率区 * 增伤区 * 反应区 * 暴击区 * 防御区 * 抗性区;
    }




//    基础攻击 = 角色基础攻击 + 武器基础攻击;
//    额外攻击 = (基础攻击 * 百分比攻击) + 圣遗物数值攻击 + 其他攻击
//    百分比攻击 = 武器百分比攻击 + 圣遗物百分比攻击 + 其他百分比攻击
//    攻击区 =  (基础攻击) + (额外攻击)
    public void set攻击区(float 攻击力) {
        this.攻击区 =  攻击力;
    }

    public void set倍率区(float 技能倍率){
        this.倍率区 = 技能倍率;
    }

    public void set增伤区(float 增伤) {
        this.增伤区 = 增伤/100 + 1;
    }

    public void set反应区(float 反应区) {
        this.反应区 = 反应区;
    }
}
